# A simple parser used to make a calculator
- Made with haskell and based functional programming 
```
> 1 + 1
2
> 2 * 6
12
> (1 + 3) * (5 + 1)
24
> (1 + 2 + 3 * 2 + 6)
15
> (1 + (2 + ((4 + 2) * 6)))
39
> 5 +-6    --This should be parsed as 5 + (-6)
-1
```
